Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/the_asylum_process_in_ireland/withdrawing_from_the_asylum_process_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Withdrawing from the international protection process
ga: Ag aistarraingt ón bpróiseas tearmainn

source: The International Protection Act 2015 provides for the withdrawal of applications for international protection (refugee status and subsidiary protection)
ga: Foráiltear in Acht na nDídeanaithe, 1996, arna leasú, d’iarratais ar stádas dídeanaí a aistarraingt

source: You may withdraw your application at the first stage or at the appeal stage
ga: Féadfaidh tú d’iarratas a aistarraingt ag an gcéad chéim nó ag céim an achomhairc

source: In certain circumstances your application may be deemed to be withdrawn – see below
ga: Faoi roinnt cúinsí, féadtar a mheas gurb ionann d’iarratas agus aistarraingthe – féach thíos

source: Withdrawal at first stage
ga: Aistarraingt ag an gcéad chéim

source: If your application for international protection is still under consideration by the International Protection Office, you may withdraw your application by notifying the Minister for Justice and Equality in writing
ga: Má tá d'iarratas ar dhearbhú fós faoi bhreithniú ag Coimisinéir Iarratais do Dhídeanaithe, féadann tú d’iarratas a aistarraingt trína fhógairt do Choimisinéir Iarratais do Dhídeanaithe i scríbhinn

source: When the Minister is notified of your withdrawal, they will refuse to give you either a declaration of refugee status or a declaration of subsidiary protection
ga: Ba cheart duit na fáthanna a leagan amach go soiléir go bhfuil tú ag aistarraingt d’achomhairc agus a chur in iúl go ndearna tú iarratas ar chead chun fanacht sa stát

source: If you have a solicitor, they will be notified
ga: Fógrófar don Aire Dlí agus Cirt faoi d’aistarraingt

source: The Minister may arrange for your removal from the State unless you have been granted permission to remain in the State
ga: Diúltóidh sé nó sí dearbhú a thabhairt duit agus féadann sé nó sí do bhaint den stát a eagrú mura ndearna tú iarratas air nó gur bronnadh cead chun fanacht duit sa Stát

source: Withdrawal at appeal stage
ga: Aistarraingt ag céim an achomhairc

source: If you wish to withdraw at the appeal stage, you should send your notice of withdrawal to the International Protection Appeals Tribunal
ga: Más mian leat aistarraingt a dhéanamh ag céim an achomhairc, ba cheart an fógra maidir le d’aistarraingt a dhéanamh i scríbhinn ar fhoirm Fógra Aistarraingthe atá ar fáil ón mBinse Achomhairc do Dhídeanaithe

source: If your appeal is withdrawn or deemed to be withdrawn, the Minister for Justice and Equality will refuse to give you a refugee or subsidiary protection declaration
ga: Ba cheart é a sheoladh chuig cathaoirleach an Bhinse Achomhairc do Dhídeanaithe

source: The Minister may then arrange for your removal from the State unless you have been granted permission to remain in the State or you have agreed to return voluntarily to your country of origin
ga: Má dhéanann tú amhlaidh, seasfar le bunchinneadh an Choimisinéara um Iarratais ó Dhídeanaithe, nár cheart dearbhú a thabhairt duit gur dídeanaí thú

source: There are a number of circumstances in which failure on your part to comply with your statutory obligations may result in your application for international protection (or your appeal against refusal) being deemed withdrawn
ga: Nuair a bhíonn foirm Fógra Aistarraingthe á comhlánú agat, ba cheart duit na cúiseanna a leagan amach go soiléir a bhfuil d’achomharc á aistarraingt agat agus a thabhair le fios má rinne tú iarratas ar chead chun fanacht sa Stát

source: In which case, the Minister shall refuse to give you a refugee status or subsidiary protection declaration
ga: Má tá aturnae agat, ba cheart dó/di d’fhoirm Fógra Aistarraingthe a chomhshíniú

source: These are as follows:
ga: Iarratais a meastar a bheith aistarraingthe

source: • Failure to inform the Minister for Justice and Equality of your address or change of address
ga: Tá roinnt cúinsí ann ina bhféadfaí d’iarratas ar stádas teifigh a mheas mar aistarraingthe de bharr mainneachtana ar do leithse chun cloí le d’oibleagáidí reachtúla; agus ina ndiúltóidh an tAire dearbhú a thabhairt duit

source: • Failure to report when required to do so
ga: Is iad seo na cúinsí:

source: • Failure to reside or remain at a particular district of place in the State when required to do so
ga: • Mainneachtain seoladh a thabhairt don Choimisinéir laistigh de 5 lá oibre ó dhéanamh d’iarratais

source: • Leaving or attempting to leave the State without the consent of the Minister for Justice and Equality
ga: • Mainneachtain an Coimisinéir a chur ar an eolas i dtaobh athrú seolta

source: • Failure to co-operate with the International Protection Office or to furnish information relevant to your application
ga: • Mainneachtain teacht i láthair nuair is gá amhlaidh

source: • Failure to attend for interview with the International Protection Office
ga: • Mainneachtain cónaí nó chun fanacht ag dúiche nó áit faoi leith sa Stát nuair is gá amhlaidh

source: • Failure to co-operate with the International Protection Appeals Tribunal or to furnish information relevant to your appeal
ga: • Fágáil nó iarracht an Stát a fhágáil gan comhthoil an Aire

source: • Failure to attend for an oral hearing with the Tribunal, without reasonable cause
ga: • Mainneachtain comhoibriú leis an gCoimisinéir Iarratais do Dhídeanaithe, nó chun faisnéis ar ábhartha do d’iarratas í a thabhairt

source: Where an application is withdrawn or is deemed withdrawn, there is no appeal
ga: • Mainneachtain freastal ar agallamh leis an gCoimisinéir

source: If your application for international protection has been withdrawn or is deemed withdrawn, but you wish to apply again, you may be able to make a subsequent application
ga: • Mainneachtain comhoibriú leis an mBinse Achomhairc do Dhídeanaithe, nó chun faisnéis ar ábhartha do d’achomharc í a thabhairt

source: You must first apply for the Minister’s consent to the making of a subsequent application
ga: • Mainneachtain freastal ar éisteacht bhéil leis an mBinse

source: If the Minister consents to the making of a subsequent application, you should make the application within 10 working days
ga: Ní bhíonn aon achomharc ann sa chás ina meastar iarratas a bheith aistarraingthe
